GopalSaraf/Practicals/PSDL/include/proc/pic16f19196.h
// Register: MONTH
#define MONTH MONTH
extern volatile unsigned char           MONTH               __at(0xC11);
#ifndef _LIB_BUILD
asm("MONTH equ 0C11h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MONTHL                 :4;
    };
    struct {
        unsigned MONTHL0                :1;
        unsigned MONTHL1                :1;
        unsigned MONTHL2                :1;
        unsigned MONTHL3                :1;
        unsigned MONTHH                 :1;
    };
} MONTHbits_t;
extern volatile MONTHbits_t MONTHbits __at(0xC11);
// bitfield macros
#define _MONTH_MONTHL_POSN                                  0x0
#define _MONTH_MONTHL_POSITION                              0x0
#define _MONTH_MONTHL_SIZE                                  0x4
#define _MONTH_MONTHL_LENGTH                                0x4
#define _MONTH_MONTHL_MASK                                  0xF
#define _MONTH_MONTHL0_POSN                                 0x0
#define _MONTH_MONTHL0_POSITION                             0x0
#define _MONTH_MONTHL0_SIZE                                 0x1
#define _MONTH_MONTHL0_LENGTH                               0x1
#define _MONTH_MONTHL0_MASK                                 0x1
#define _MONTH_MONTHL1_POSN                                 0x1
#define _MONTH_MONTHL1_POSITION                             0x1
#define _MONTH_MONTHL1_SIZE                                 0x1
#define _MONTH_MONTHL1_LENGTH                               0x1
#define _MONTH_MONTHL1_MASK                                 0x2
#define _MONTH_MONTHL2_POSN                                 0x2
#define _MONTH_MONTHL2_POSITION                             0x2
#define _MONTH_MONTHL2_SIZE                                 0x1
#define _MONTH_MONTHL2_LENGTH                               0x1
#define _MONTH_MONTHL2_MASK                                 0x4
#define _MONTH_MONTHL3_POSN                                 0x3
#define _MONTH_MONTHL3_POSITION                             0x3
#define _MONTH_MONTHL3_SIZE                                 0x1
#define _MONTH_MONTHL3_LENGTH                               0x1
#define _MONTH_MONTHL3_MASK                                 0x8
#define _MONTH_MONTHH_POSN                                  0x4
#define _MONTH_MONTHH_POSITION                              0x4
#define _MONTH_MONTHH_SIZE                                  0x1
#define _MONTH_MONTHH_LENGTH                                0x1
#define _MONTH_MONTHH_MASK                                  0x10

// Register: WEEKDAY
#define WEEKDAY WEEKDAY
extern volatile unsigned char           WEEKDAY             __at(0xC12);
#ifndef _LIB_BUILD
asm("WEEKDAY equ 0C12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WDAY                   :3;
    };
    struct {
        unsigned WDAY0                  :1;
        unsigned WDAY1                  :1;
        unsigned WDAY2                  :1;
    };
} WEEKDAYbits_t;
extern volatile WEEKDAYbits_t WEEKDAYbits __at(0xC12);
// bitfield macros
#define _WEEKDAY_WDAY_POSN                                  0x0
#define _WEEKDAY_WDAY_POSITION                              0x0
#define _WEEKDAY_WDAY_SIZE                                  0x3
#define _WEEKDAY_WDAY_LENGTH                                0x3
#define _WEEKDAY_WDAY_MASK                                  0x7
#define _WEEKDAY_WDAY0_POSN                                 0x0
#define _WEEKDAY_WDAY0_POSITION                             0x0
#define _WEEKDAY_WDAY0_SIZE                                 0x1
#define _WEEKDAY_WDAY0_LENGTH                               0x1
#define _WEEKDAY_WDAY0_MASK                                 0x1
#define _WEEKDAY_WDAY1_POSN                                 0x1
#define _WEEKDAY_WDAY1_POSITION                             0x1
#define _WEEKDAY_WDAY1_SIZE                                 0x1
#define _WEEKDAY_WDAY1_LENGTH                               0x1
#define _WEEKDAY_WDAY1_MASK                                 0x2
#define _WEEKDAY_WDAY2_POSN                                 0x2
#define _WEEKDAY_WDAY2_POSITION                             0x2
#define _WEEKDAY_WDAY2_SIZE                                 0x1
#define _WEEKDAY_WDAY2_LENGTH                               0x1
#define _WEEKDAY_WDAY2_MASK                                 0x4

// Register: DAY
#define DAY DAY
extern volatile unsigned char           DAY                 __at(0xC13);
#ifndef _LIB_BUILD
asm("DAY equ 0C13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAYL                   :4;
        unsigned DAYH                   :2;
    };
    struct {
        unsigned DAYL0                  :1;
        unsigned DAYL1                  :1;
        unsigned DAYL2                  :1;
        unsigned DAYL3                  :1;
        unsigned DAYH0                  :1;
        unsigned DAYH1                  :1;
    };
} DAYbits_t;
extern volatile DAYbits_t DAYbits __at(0xC13);
// bitfield macros
#define _DAY_DAYL_POSN                                      0x0
#define _DAY_DAYL_POSITION                                  0x0
#define _DAY_DAYL_SIZE                                      0x4
#define _DAY_DAYL_LENGTH                                    0x4
#define _DAY_DAYL_MASK                                      0xF
#define _DAY_DAYH_POSN                                      0x4
#define _DAY_DAYH_POSITION                                  0x4
#define _DAY_DAYH_SIZE                                      0x2
#define _DAY_DAYH_LENGTH                                    0x2
#define _DAY_DAYH_MASK                                      0x30
#define _DAY_DAYL0_POSN                                     0x0
#define _DAY_DAYL0_POSITION                                 0x0
#define _DAY_DAYL0_SIZE                                     0x1
#define _DAY_DAYL0_LENGTH                                   0x1
#define _DAY_DAYL0_MASK                                     0x1
#define _DAY_DAYL1_POSN                                     0x1
#define _DAY_DAYL1_POSITION                                 0x1
#define _DAY_DAYL1_SIZE                                     0x1
#define _DAY_DAYL1_LENGTH                                   0x1
#define _DAY_DAYL1_MASK                                     0x2
#define _DAY_DAYL2_POSN                                     0x2
#define _DAY_DAYL2_POSITION                                 0x2
#define _DAY_DAYL2_SIZE                                     0x1
#define _DAY_DAYL2_LENGTH                                   0x1
#define _DAY_DAYL2_MASK                                     0x4
#define _DAY_DAYL3_POSN                                     0x3
#define _DAY_DAYL3_POSITION                                 0x3
#define _DAY_DAYL3_SIZE                                     0x1
#define _DAY_DAYL3_LENGTH                                   0x1
#define _DAY_DAYL3_MASK                                     0x8
#define _DAY_DAYH0_POSN                                     0x4
#define _DAY_DAYH0_POSITION                                 0x4
#define _DAY_DAYH0_SIZE                                     0x1
#define _DAY_DAYH0_LENGTH                                   0x1
#define _DAY_DAYH0_MASK                                     0x10
#define _DAY_DAYH1_POSN                                     0x5
#define _DAY_DAYH1_POSITION                                 0x5
#define _DAY_DAYH1_SIZE                                     0x1
#define _DAY_DAYH1_LENGTH                                   0x1
#define _DAY_DAYH1_MASK                                     0x20

// Register: HOURS
#define HOURS HOURS
extern volatile unsigned char           HOURS               __at(0xC14);
#ifndef _LIB_BUILD
asm("HOURS equ 0C14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HRL                    :4;
        unsigned HRH                    :2;
    };
    struct {
        unsigned HRL0                   :1;
        unsigned HRL1                   :1;
        unsigned HRL2                   :1;
        unsigned HRL3                   :1;
        unsigned HRH0                   :1;
        unsigned HRH1                   :1;
    };
} HOURSbits_t;
extern volatile HOURSbits_t HOURSbits __at(0xC14);
// bitfield macros
#define _HOURS_HRL_POSN                                     0x0
#define _HOURS_HRL_POSITION                                 0x0
#define _HOURS_HRL_SIZE                                     0x4
#define _HOURS_HRL_LENGTH                                   0x4
#define _HOURS_HRL_MASK                                     0xF
#define _HOURS_HRH_POSN                                     0x4
#define _HOURS_HRH_POSITION                                 0x4
#define _HOURS_HRH_SIZE                                     0x2
#define _HOURS_HRH_LENGTH                                   0x2
#define _HOURS_HRH_MASK                                     0x30
#define _HOURS_HRL0_POSN                                    0x0
#define _HOURS_HRL0_POSITION                                0x0
#define _HOURS_HRL0_SIZE                                    0x1
#define _HOURS_HRL0_LENGTH                                  0x1
#define _HOURS_HRL0_MASK                                    0x1
#define _HOURS_HRL1_POSN                                    0x1
#define _HOURS_HRL1_POSITION                                0x1
#define _HOURS_HRL1_SIZE                                    0x1
#define _HOURS_HRL1_LENGTH                                  0x1
#define _HOURS_HRL1_MASK                                    0x2
#define _HOURS_HRL2_POSN                                    0x2
#define _HOURS_HRL2_POSITION                                0x2
#define _HOURS_HRL2_SIZE                                    0x1
#define _HOURS_HRL2_LENGTH                                  0x1
#define _HOURS_HRL2_MASK                                    0x4
#define _HOURS_HRL3_POSN                                    0x3
#define _HOURS_HRL3_POSITION                                0x3
#define _HOURS_HRL3_SIZE                                    0x1
#define _HOURS_HRL3_LENGTH                                  0x1
#define _HOURS_HRL3_MASK                                    0x8
#define _HOURS_HRH0_POSN                                    0x4
#define _HOURS_HRH0_POSITION                                0x4
#define _HOURS_HRH0_SIZE                                    0x1
#define _HOURS_HRH0_LENGTH                                  0x1
#define _HOURS_HRH0_MASK                                    0x10
#define _HOURS_HRH1_POSN                                    0x5
#define _HOURS_HRH1_POSITION                                0x5
#define _HOURS_HRH1_SIZE                                    0x1
#define _HOURS_HRH1_LENGTH                                  0x1
#define _HOURS_HRH1_MASK                                    0x20

// Register: MINUTES
#define MINUTES MINUTES
extern volatile unsigned char           MINUTES             __at(0xC15);
#ifndef _LIB_BUILD
asm("MINUTES equ 0C15h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MINL                   :4;
        unsigned MINH                   :3;
    };
    struct {
        unsigned MINL0                  :1;
        unsigned MINL1                  :1;
        unsigned MINL2                  :1;
        unsigned MINL3                  :1;
        unsigned MINH0                  :1;
        unsigned MINH1                  :1;
        unsigned MINH2                  :1;
    };
} MINUTESbits_t;
extern volatile MINUTESbits_t MINUTESbits __at(0xC15);
// bitfield macros
#define _MINUTES_MINL_POSN                                  0x0
#define _MINUTES_MINL_POSITION                              0x0
#define _MINUTES_MINL_SIZE                                  0x4
#define _MINUTES_MINL_LENGTH                                0x4
#define _MINUTES_MINL_MASK                                  0xF
#define _MINUTES_MINH_POSN                                  0x4
#define _MINUTES_MINH_POSITION                              0x4
#define _MINUTES_MINH_SIZE                                  0x3
#define _MINUTES_MINH_LENGTH                                0x3
#define _MINUTES_MINH_MASK                                  0x70
#define _MINUTES_MINL0_POSN                                 0x0
#define _MINUTES_MINL0_POSITION                             0x0
#define _MINUTES_MINL0_SIZE                                 0x1
#define _MINUTES_MINL0_LENGTH                               0x1
#define _MINUTES_MINL0_MASK                                 0x1
#define _MINUTES_MINL1_POSN                                 0x1
#define _MINUTES_MINL1_POSITION                             0x1
#define _MINUTES_MINL1_SIZE                                 0x1
#define _MINUTES_MINL1_LENGTH                               0x1
#define _MINUTES_MINL1_MASK                                 0x2
#define _MINUTES_MINL2_POSN                                 0x2
#define _MINUTES_MINL2_POSITION                             0x2
#define _MINUTES_MINL2_SIZE                                 0x1
#define _MINUTES_MINL2_LENGTH                               0x1
#define _MINUTES_MINL2_MASK                                 0x4
#define _MINUTES_MINL3_POSN                                 0x3
#define _MINUTES_MINL3_POSITION                             0x3
#define _MINUTES_MINL3_SIZE                                 0x1
#define _MINUTES_MINL3_LENGTH                               0x1
#define _MINUTES_MINL3_MASK                                 0x8
#define _MINUTES_MINH0_POSN                                 0x4
#define _MINUTES_MINH0_POSITION                             0x4
#define _MINUTES_MINH0_SIZE                                 0x1
#define _MINUTES_MINH0_LENGTH                               0x1
#define _MINUTES_MINH0_MASK                                 0x10
#define _MINUTES_MINH1_POSN                                 0x5
#define _MINUTES_MINH1_POSITION                             0x5
#define _MINUTES_MINH1_SIZE                                 0x1
#define _MINUTES_MINH1_LENGTH                               0x1
#define _MINUTES_MINH1_MASK                                 0x20
#define _MINUTES_MINH2_POSN                                 0x6
#define _MINUTES_MINH2_POSITION                             0x6
#define _MINUTES_MINH2_SIZE                                 0x1
#define _MINUTES_MINH2_LENGTH                               0x1
#define _MINUTES_MINH2_MASK                                 0x40

