GopalSaraf/Practicals/PSDL/include/proc/pic16f19196.h
extern volatile LCDDATA28bits_t LCDDATA28bits __at(0x1D34);
// bitfield macros
#define _LCDDATA28_S32C4_POSN                               0x0
#define _LCDDATA28_S32C4_POSITION                           0x0
#define _LCDDATA28_S32C4_SIZE                               0x1
#define _LCDDATA28_S32C4_LENGTH                             0x1
#define _LCDDATA28_S32C4_MASK                               0x1
#define _LCDDATA28_S33C4_POSN                               0x1
#define _LCDDATA28_S33C4_POSITION                           0x1
#define _LCDDATA28_S33C4_SIZE                               0x1
#define _LCDDATA28_S33C4_LENGTH                             0x1
#define _LCDDATA28_S33C4_MASK                               0x2
#define _LCDDATA28_S34C4_POSN                               0x2
#define _LCDDATA28_S34C4_POSITION                           0x2
#define _LCDDATA28_S34C4_SIZE                               0x1
#define _LCDDATA28_S34C4_LENGTH                             0x1
#define _LCDDATA28_S34C4_MASK                               0x4
#define _LCDDATA28_S35C4_POSN                               0x3
#define _LCDDATA28_S35C4_POSITION                           0x3
#define _LCDDATA28_S35C4_SIZE                               0x1
#define _LCDDATA28_S35C4_LENGTH                             0x1
#define _LCDDATA28_S35C4_MASK                               0x8
#define _LCDDATA28_S36C4_POSN                               0x4
#define _LCDDATA28_S36C4_POSITION                           0x4
#define _LCDDATA28_S36C4_SIZE                               0x1
#define _LCDDATA28_S36C4_LENGTH                             0x1
#define _LCDDATA28_S36C4_MASK                               0x10
#define _LCDDATA28_S37C4_POSN                               0x5
#define _LCDDATA28_S37C4_POSITION                           0x5
#define _LCDDATA28_S37C4_SIZE                               0x1
#define _LCDDATA28_S37C4_LENGTH                             0x1
#define _LCDDATA28_S37C4_MASK                               0x20
#define _LCDDATA28_S38C4_POSN                               0x6
#define _LCDDATA28_S38C4_POSITION                           0x6
#define _LCDDATA28_S38C4_SIZE                               0x1
#define _LCDDATA28_S38C4_LENGTH                             0x1
#define _LCDDATA28_S38C4_MASK                               0x40
#define _LCDDATA28_S39C4_POSN                               0x7
#define _LCDDATA28_S39C4_POSITION                           0x7
#define _LCDDATA28_S39C4_SIZE                               0x1
#define _LCDDATA28_S39C4_LENGTH                             0x1
#define _LCDDATA28_S39C4_MASK                               0x80

// Register: LCDDATA29
#define LCDDATA29 LCDDATA29
extern volatile unsigned char           LCDDATA29           __at(0x1D35);
#ifndef _LIB_BUILD
asm("LCDDATA29 equ 01D35h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S40C4                  :1;
        unsigned S41C4                  :1;
        unsigned S42C4                  :1;
        unsigned S43C4                  :1;
        unsigned S44C4                  :1;
        unsigned S45C4                  :1;
    };
} LCDDATA29bits_t;
extern volatile LCDDATA29bits_t LCDDATA29bits __at(0x1D35);
// bitfield macros
#define _LCDDATA29_S40C4_POSN                               0x0
#define _LCDDATA29_S40C4_POSITION                           0x0
#define _LCDDATA29_S40C4_SIZE                               0x1
#define _LCDDATA29_S40C4_LENGTH                             0x1
#define _LCDDATA29_S40C4_MASK                               0x1
#define _LCDDATA29_S41C4_POSN                               0x1
#define _LCDDATA29_S41C4_POSITION                           0x1
#define _LCDDATA29_S41C4_SIZE                               0x1
#define _LCDDATA29_S41C4_LENGTH                             0x1
#define _LCDDATA29_S41C4_MASK                               0x2
#define _LCDDATA29_S42C4_POSN                               0x2
#define _LCDDATA29_S42C4_POSITION                           0x2
#define _LCDDATA29_S42C4_SIZE                               0x1
#define _LCDDATA29_S42C4_LENGTH                             0x1
#define _LCDDATA29_S42C4_MASK                               0x4
#define _LCDDATA29_S43C4_POSN                               0x3
#define _LCDDATA29_S43C4_POSITION                           0x3
#define _LCDDATA29_S43C4_SIZE                               0x1
#define _LCDDATA29_S43C4_LENGTH                             0x1
#define _LCDDATA29_S43C4_MASK                               0x8
#define _LCDDATA29_S44C4_POSN                               0x4
#define _LCDDATA29_S44C4_POSITION                           0x4
#define _LCDDATA29_S44C4_SIZE                               0x1
#define _LCDDATA29_S44C4_LENGTH                             0x1
#define _LCDDATA29_S44C4_MASK                               0x10
#define _LCDDATA29_S45C4_POSN                               0x5
#define _LCDDATA29_S45C4_POSITION                           0x5
#define _LCDDATA29_S45C4_SIZE                               0x1
#define _LCDDATA29_S45C4_LENGTH                             0x1
#define _LCDDATA29_S45C4_MASK                               0x20

// Register: LCDDATA30
#define LCDDATA30 LCDDATA30
extern volatile unsigned char           LCDDATA30           __at(0x1D36);
#ifndef _LIB_BUILD
asm("LCDDATA30 equ 01D36h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C5                  :1;
        unsigned S01C5                  :1;
        unsigned S02C5                  :1;
        unsigned S03C5                  :1;
        unsigned S04C5                  :1;
        unsigned S05C5                  :1;
        unsigned S06C5                  :1;
        unsigned S07C5                  :1;
    };
} LCDDATA30bits_t;
extern volatile LCDDATA30bits_t LCDDATA30bits __at(0x1D36);
// bitfield macros
#define _LCDDATA30_S00C5_POSN                               0x0
#define _LCDDATA30_S00C5_POSITION                           0x0
#define _LCDDATA30_S00C5_SIZE                               0x1
#define _LCDDATA30_S00C5_LENGTH                             0x1
#define _LCDDATA30_S00C5_MASK                               0x1
#define _LCDDATA30_S01C5_POSN                               0x1
#define _LCDDATA30_S01C5_POSITION                           0x1
#define _LCDDATA30_S01C5_SIZE                               0x1
#define _LCDDATA30_S01C5_LENGTH                             0x1
#define _LCDDATA30_S01C5_MASK                               0x2
#define _LCDDATA30_S02C5_POSN                               0x2
#define _LCDDATA30_S02C5_POSITION                           0x2
#define _LCDDATA30_S02C5_SIZE                               0x1
#define _LCDDATA30_S02C5_LENGTH                             0x1
#define _LCDDATA30_S02C5_MASK                               0x4
#define _LCDDATA30_S03C5_POSN                               0x3
#define _LCDDATA30_S03C5_POSITION                           0x3
#define _LCDDATA30_S03C5_SIZE                               0x1
#define _LCDDATA30_S03C5_LENGTH                             0x1
#define _LCDDATA30_S03C5_MASK                               0x8
#define _LCDDATA30_S04C5_POSN                               0x4
#define _LCDDATA30_S04C5_POSITION                           0x4
#define _LCDDATA30_S04C5_SIZE                               0x1
#define _LCDDATA30_S04C5_LENGTH                             0x1
#define _LCDDATA30_S04C5_MASK                               0x10
#define _LCDDATA30_S05C5_POSN                               0x5
#define _LCDDATA30_S05C5_POSITION                           0x5
#define _LCDDATA30_S05C5_SIZE                               0x1
#define _LCDDATA30_S05C5_LENGTH                             0x1
#define _LCDDATA30_S05C5_MASK                               0x20
#define _LCDDATA30_S06C5_POSN                               0x6
#define _LCDDATA30_S06C5_POSITION                           0x6
#define _LCDDATA30_S06C5_SIZE                               0x1
#define _LCDDATA30_S06C5_LENGTH                             0x1
#define _LCDDATA30_S06C5_MASK                               0x40
#define _LCDDATA30_S07C5_POSN                               0x7
#define _LCDDATA30_S07C5_POSITION                           0x7
#define _LCDDATA30_S07C5_SIZE                               0x1
#define _LCDDATA30_S07C5_LENGTH                             0x1
#define _LCDDATA30_S07C5_MASK                               0x80

// Register: LCDDATA31
#define LCDDATA31 LCDDATA31
extern volatile unsigned char           LCDDATA31           __at(0x1D37);
#ifndef _LIB_BUILD
asm("LCDDATA31 equ 01D37h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C5                  :1;
        unsigned S09C5                  :1;
        unsigned S10C5                  :1;
        unsigned S11C5                  :1;
        unsigned S12C5                  :1;
        unsigned S13C5                  :1;
        unsigned S14C5                  :1;
        unsigned S15C5                  :1;
    };
} LCDDATA31bits_t;
extern volatile LCDDATA31bits_t LCDDATA31bits __at(0x1D37);
// bitfield macros
#define _LCDDATA31_S08C5_POSN                               0x0
#define _LCDDATA31_S08C5_POSITION                           0x0
#define _LCDDATA31_S08C5_SIZE                               0x1
#define _LCDDATA31_S08C5_LENGTH                             0x1
#define _LCDDATA31_S08C5_MASK                               0x1
#define _LCDDATA31_S09C5_POSN                               0x1
#define _LCDDATA31_S09C5_POSITION                           0x1
#define _LCDDATA31_S09C5_SIZE                               0x1
#define _LCDDATA31_S09C5_LENGTH                             0x1
#define _LCDDATA31_S09C5_MASK                               0x2
#define _LCDDATA31_S10C5_POSN                               0x2
#define _LCDDATA31_S10C5_POSITION                           0x2
#define _LCDDATA31_S10C5_SIZE                               0x1
#define _LCDDATA31_S10C5_LENGTH                             0x1
#define _LCDDATA31_S10C5_MASK                               0x4
#define _LCDDATA31_S11C5_POSN                               0x3
#define _LCDDATA31_S11C5_POSITION                           0x3
#define _LCDDATA31_S11C5_SIZE                               0x1
#define _LCDDATA31_S11C5_LENGTH                             0x1
#define _LCDDATA31_S11C5_MASK                               0x8
#define _LCDDATA31_S12C5_POSN                               0x4
#define _LCDDATA31_S12C5_POSITION                           0x4
#define _LCDDATA31_S12C5_SIZE                               0x1
#define _LCDDATA31_S12C5_LENGTH                             0x1
#define _LCDDATA31_S12C5_MASK                               0x10
#define _LCDDATA31_S13C5_POSN                               0x5
#define _LCDDATA31_S13C5_POSITION                           0x5
#define _LCDDATA31_S13C5_SIZE                               0x1
#define _LCDDATA31_S13C5_LENGTH                             0x1
#define _LCDDATA31_S13C5_MASK                               0x20
#define _LCDDATA31_S14C5_POSN                               0x6
#define _LCDDATA31_S14C5_POSITION                           0x6
#define _LCDDATA31_S14C5_SIZE                               0x1
#define _LCDDATA31_S14C5_LENGTH                             0x1
#define _LCDDATA31_S14C5_MASK                               0x40
#define _LCDDATA31_S15C5_POSN                               0x7
#define _LCDDATA31_S15C5_POSITION                           0x7
#define _LCDDATA31_S15C5_SIZE                               0x1
#define _LCDDATA31_S15C5_LENGTH                             0x1
#define _LCDDATA31_S15C5_MASK                               0x80

// Register: LCDDATA32
#define LCDDATA32 LCDDATA32
extern volatile unsigned char           LCDDATA32           __at(0x1D38);
#ifndef _LIB_BUILD
asm("LCDDATA32 equ 01D38h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S16C5                  :1;
        unsigned S17C5                  :1;
        unsigned S18C5                  :1;
        unsigned S19C5                  :1;
        unsigned S20C5                  :1;
        unsigned S21C5                  :1;
        unsigned S22C5                  :1;
        unsigned S23C5                  :1;
    };
} LCDDATA32bits_t;
extern volatile LCDDATA32bits_t LCDDATA32bits __at(0x1D38);
// bitfield macros
#define _LCDDATA32_S16C5_POSN                               0x0
#define _LCDDATA32_S16C5_POSITION                           0x0
#define _LCDDATA32_S16C5_SIZE                               0x1
#define _LCDDATA32_S16C5_LENGTH                             0x1
#define _LCDDATA32_S16C5_MASK                               0x1
#define _LCDDATA32_S17C5_POSN                               0x1
#define _LCDDATA32_S17C5_POSITION                           0x1
#define _LCDDATA32_S17C5_SIZE                               0x1
#define _LCDDATA32_S17C5_LENGTH                             0x1
#define _LCDDATA32_S17C5_MASK                               0x2
#define _LCDDATA32_S18C5_POSN                               0x2
#define _LCDDATA32_S18C5_POSITION                           0x2
#define _LCDDATA32_S18C5_SIZE                               0x1
#define _LCDDATA32_S18C5_LENGTH                             0x1
#define _LCDDATA32_S18C5_MASK                               0x4
#define _LCDDATA32_S19C5_POSN                               0x3
#define _LCDDATA32_S19C5_POSITION                           0x3
#define _LCDDATA32_S19C5_SIZE                               0x1
#define _LCDDATA32_S19C5_LENGTH                             0x1
#define _LCDDATA32_S19C5_MASK                               0x8
#define _LCDDATA32_S20C5_POSN                               0x4
#define _LCDDATA32_S20C5_POSITION                           0x4
#define _LCDDATA32_S20C5_SIZE                               0x1
#define _LCDDATA32_S20C5_LENGTH                             0x1
#define _LCDDATA32_S20C5_MASK                               0x10
#define _LCDDATA32_S21C5_POSN                               0x5
#define _LCDDATA32_S21C5_POSITION                           0x5
#define _LCDDATA32_S21C5_SIZE                               0x1
#define _LCDDATA32_S21C5_LENGTH                             0x1
#define _LCDDATA32_S21C5_MASK                               0x20
#define _LCDDATA32_S22C5_POSN                               0x6
#define _LCDDATA32_S22C5_POSITION                           0x6
#define _LCDDATA32_S22C5_SIZE                               0x1
#define _LCDDATA32_S22C5_LENGTH                             0x1
#define _LCDDATA32_S22C5_MASK                               0x40
#define _LCDDATA32_S23C5_POSN                               0x7
#define _LCDDATA32_S23C5_POSITION                           0x7
#define _LCDDATA32_S23C5_SIZE                               0x1
#define _LCDDATA32_S23C5_LENGTH                             0x1
#define _LCDDATA32_S23C5_MASK                               0x80

// Register: LCDDATA33
#define LCDDATA33 LCDDATA33
extern volatile unsigned char           LCDDATA33           __at(0x1D39);
#ifndef _LIB_BUILD
asm("LCDDATA33 equ 01D39h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S24C5                  :1;
        unsigned S25C5                  :1;
        unsigned S26C5                  :1;
        unsigned S27C5                  :1;
        unsigned S28C5                  :1;
        unsigned S29C5                  :1;
        unsigned S30C5                  :1;
        unsigned S31C5                  :1;
    };
} LCDDATA33bits_t;
