GopalSaraf/Practicals/PSDL/include/proc/pic16f19196.h
extern volatile LCDDATA40bits_t LCDDATA40bits __at(0x1D40);
// bitfield macros
#define _LCDDATA40_S32C6_POSN                               0x0
#define _LCDDATA40_S32C6_POSITION                           0x0
#define _LCDDATA40_S32C6_SIZE                               0x1
#define _LCDDATA40_S32C6_LENGTH                             0x1
#define _LCDDATA40_S32C6_MASK                               0x1
#define _LCDDATA40_S33C6_POSN                               0x1
#define _LCDDATA40_S33C6_POSITION                           0x1
#define _LCDDATA40_S33C6_SIZE                               0x1
#define _LCDDATA40_S33C6_LENGTH                             0x1
#define _LCDDATA40_S33C6_MASK                               0x2
#define _LCDDATA40_S34C6_POSN                               0x2
#define _LCDDATA40_S34C6_POSITION                           0x2
#define _LCDDATA40_S34C6_SIZE                               0x1
#define _LCDDATA40_S34C6_LENGTH                             0x1
#define _LCDDATA40_S34C6_MASK                               0x4
#define _LCDDATA40_S35C6_POSN                               0x3
#define _LCDDATA40_S35C6_POSITION                           0x3
#define _LCDDATA40_S35C6_SIZE                               0x1
#define _LCDDATA40_S35C6_LENGTH                             0x1
#define _LCDDATA40_S35C6_MASK                               0x8
#define _LCDDATA40_S36C6_POSN                               0x4
#define _LCDDATA40_S36C6_POSITION                           0x4
#define _LCDDATA40_S36C6_SIZE                               0x1
#define _LCDDATA40_S36C6_LENGTH                             0x1
#define _LCDDATA40_S36C6_MASK                               0x10
#define _LCDDATA40_S37C6_POSN                               0x5
#define _LCDDATA40_S37C6_POSITION                           0x5
#define _LCDDATA40_S37C6_SIZE                               0x1
#define _LCDDATA40_S37C6_LENGTH                             0x1
#define _LCDDATA40_S37C6_MASK                               0x20
#define _LCDDATA40_S38C6_POSN                               0x6
#define _LCDDATA40_S38C6_POSITION                           0x6
#define _LCDDATA40_S38C6_SIZE                               0x1
#define _LCDDATA40_S38C6_LENGTH                             0x1
#define _LCDDATA40_S38C6_MASK                               0x40
#define _LCDDATA40_S39C6_POSN                               0x7
#define _LCDDATA40_S39C6_POSITION                           0x7
#define _LCDDATA40_S39C6_SIZE                               0x1
#define _LCDDATA40_S39C6_LENGTH                             0x1
#define _LCDDATA40_S39C6_MASK                               0x80

// Register: LCDDATA41
#define LCDDATA41 LCDDATA41
extern volatile unsigned char           LCDDATA41           __at(0x1D41);
#ifndef _LIB_BUILD
asm("LCDDATA41 equ 01D41h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S40C6                  :1;
        unsigned S41C6                  :1;
        unsigned S42C6                  :1;
        unsigned S43C6                  :1;
        unsigned S44C6                  :1;
        unsigned S45C6                  :1;
    };
} LCDDATA41bits_t;
extern volatile LCDDATA41bits_t LCDDATA41bits __at(0x1D41);
// bitfield macros
#define _LCDDATA41_S40C6_POSN                               0x0
#define _LCDDATA41_S40C6_POSITION                           0x0
#define _LCDDATA41_S40C6_SIZE                               0x1
#define _LCDDATA41_S40C6_LENGTH                             0x1
#define _LCDDATA41_S40C6_MASK                               0x1
#define _LCDDATA41_S41C6_POSN                               0x1
#define _LCDDATA41_S41C6_POSITION                           0x1
#define _LCDDATA41_S41C6_SIZE                               0x1
#define _LCDDATA41_S41C6_LENGTH                             0x1
#define _LCDDATA41_S41C6_MASK                               0x2
#define _LCDDATA41_S42C6_POSN                               0x2
#define _LCDDATA41_S42C6_POSITION                           0x2
#define _LCDDATA41_S42C6_SIZE                               0x1
#define _LCDDATA41_S42C6_LENGTH                             0x1
#define _LCDDATA41_S42C6_MASK                               0x4
#define _LCDDATA41_S43C6_POSN                               0x3
#define _LCDDATA41_S43C6_POSITION                           0x3
#define _LCDDATA41_S43C6_SIZE                               0x1
#define _LCDDATA41_S43C6_LENGTH                             0x1
#define _LCDDATA41_S43C6_MASK                               0x8
#define _LCDDATA41_S44C6_POSN                               0x4
#define _LCDDATA41_S44C6_POSITION                           0x4
#define _LCDDATA41_S44C6_SIZE                               0x1
#define _LCDDATA41_S44C6_LENGTH                             0x1
#define _LCDDATA41_S44C6_MASK                               0x10
#define _LCDDATA41_S45C6_POSN                               0x5
#define _LCDDATA41_S45C6_POSITION                           0x5
#define _LCDDATA41_S45C6_SIZE                               0x1
#define _LCDDATA41_S45C6_LENGTH                             0x1
#define _LCDDATA41_S45C6_MASK                               0x20

// Register: LCDDATA42
#define LCDDATA42 LCDDATA42
extern volatile unsigned char           LCDDATA42           __at(0x1D42);
#ifndef _LIB_BUILD
asm("LCDDATA42 equ 01D42h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C7                  :1;
        unsigned S01C7                  :1;
        unsigned S02C7                  :1;
        unsigned S03C7                  :1;
        unsigned S04C7                  :1;
        unsigned S05C7                  :1;
        unsigned S06C7                  :1;
        unsigned S07C7                  :1;
    };
} LCDDATA42bits_t;
extern volatile LCDDATA42bits_t LCDDATA42bits __at(0x1D42);
// bitfield macros
#define _LCDDATA42_S00C7_POSN                               0x0
#define _LCDDATA42_S00C7_POSITION                           0x0
#define _LCDDATA42_S00C7_SIZE                               0x1
#define _LCDDATA42_S00C7_LENGTH                             0x1
#define _LCDDATA42_S00C7_MASK                               0x1
#define _LCDDATA42_S01C7_POSN                               0x1
#define _LCDDATA42_S01C7_POSITION                           0x1
#define _LCDDATA42_S01C7_SIZE                               0x1
#define _LCDDATA42_S01C7_LENGTH                             0x1
#define _LCDDATA42_S01C7_MASK                               0x2
#define _LCDDATA42_S02C7_POSN                               0x2
#define _LCDDATA42_S02C7_POSITION                           0x2
#define _LCDDATA42_S02C7_SIZE                               0x1
#define _LCDDATA42_S02C7_LENGTH                             0x1
#define _LCDDATA42_S02C7_MASK                               0x4
#define _LCDDATA42_S03C7_POSN                               0x3
#define _LCDDATA42_S03C7_POSITION                           0x3
#define _LCDDATA42_S03C7_SIZE                               0x1
#define _LCDDATA42_S03C7_LENGTH                             0x1
#define _LCDDATA42_S03C7_MASK                               0x8
#define _LCDDATA42_S04C7_POSN                               0x4
#define _LCDDATA42_S04C7_POSITION                           0x4
#define _LCDDATA42_S04C7_SIZE                               0x1
#define _LCDDATA42_S04C7_LENGTH                             0x1
#define _LCDDATA42_S04C7_MASK                               0x10
#define _LCDDATA42_S05C7_POSN                               0x5
#define _LCDDATA42_S05C7_POSITION                           0x5
#define _LCDDATA42_S05C7_SIZE                               0x1
#define _LCDDATA42_S05C7_LENGTH                             0x1
#define _LCDDATA42_S05C7_MASK                               0x20
#define _LCDDATA42_S06C7_POSN                               0x6
#define _LCDDATA42_S06C7_POSITION                           0x6
#define _LCDDATA42_S06C7_SIZE                               0x1
#define _LCDDATA42_S06C7_LENGTH                             0x1
#define _LCDDATA42_S06C7_MASK                               0x40
#define _LCDDATA42_S07C7_POSN                               0x7
#define _LCDDATA42_S07C7_POSITION                           0x7
#define _LCDDATA42_S07C7_SIZE                               0x1
#define _LCDDATA42_S07C7_LENGTH                             0x1
#define _LCDDATA42_S07C7_MASK                               0x80

