GopalSaraf/Practicals/PSDL/include/proc/pic16f19196.h
extern volatile INLVLGbits_t INLVLGbits __at(0x1E5F);
// bitfield macros
#define _INLVLG_INLVLG0_POSN                                0x0
#define _INLVLG_INLVLG0_POSITION                            0x0
#define _INLVLG_INLVLG0_SIZE                                0x1
#define _INLVLG_INLVLG0_LENGTH                              0x1
#define _INLVLG_INLVLG0_MASK                                0x1
#define _INLVLG_INLVLG1_POSN                                0x1
#define _INLVLG_INLVLG1_POSITION                            0x1
#define _INLVLG_INLVLG1_SIZE                                0x1
#define _INLVLG_INLVLG1_LENGTH                              0x1
#define _INLVLG_INLVLG1_MASK                                0x2
#define _INLVLG_INLVLG2_POSN                                0x2
#define _INLVLG_INLVLG2_POSITION                            0x2
#define _INLVLG_INLVLG2_SIZE                                0x1
#define _INLVLG_INLVLG2_LENGTH                              0x1
#define _INLVLG_INLVLG2_MASK                                0x4
#define _INLVLG_INLVLG3_POSN                                0x3
#define _INLVLG_INLVLG3_POSITION                            0x3
#define _INLVLG_INLVLG3_SIZE                                0x1
#define _INLVLG_INLVLG3_LENGTH                              0x1
#define _INLVLG_INLVLG3_MASK                                0x8
#define _INLVLG_INLVLG4_POSN                                0x4
#define _INLVLG_INLVLG4_POSITION                            0x4
#define _INLVLG_INLVLG4_SIZE                                0x1
#define _INLVLG_INLVLG4_LENGTH                              0x1
#define _INLVLG_INLVLG4_MASK                                0x10
#define _INLVLG_INLVLG5_POSN                                0x5
#define _INLVLG_INLVLG5_POSITION                            0x5
#define _INLVLG_INLVLG5_SIZE                                0x1
#define _INLVLG_INLVLG5_LENGTH                              0x1
#define _INLVLG_INLVLG5_MASK                                0x20
#define _INLVLG_INLVLG6_POSN                                0x6
#define _INLVLG_INLVLG6_POSITION                            0x6
#define _INLVLG_INLVLG6_SIZE                                0x1
#define _INLVLG_INLVLG6_LENGTH                              0x1
#define _INLVLG_INLVLG6_MASK                                0x40
#define _INLVLG_INLVLG7_POSN                                0x7
#define _INLVLG_INLVLG7_POSITION                            0x7
#define _INLVLG_INLVLG7_SIZE                                0x1
#define _INLVLG_INLVLG7_LENGTH                              0x1
#define _INLVLG_INLVLG7_MASK                                0x80

// Register: IOCGP
#define IOCGP IOCGP
extern volatile unsigned char           IOCGP               __at(0x1E60);
#ifndef _LIB_BUILD
asm("IOCGP equ 01E60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned IOCGP5                 :1;
    };
} IOCGPbits_t;
extern volatile IOCGPbits_t IOCGPbits __at(0x1E60);
// bitfield macros
#define _IOCGP_IOCGP5_POSN                                  0x5
#define _IOCGP_IOCGP5_POSITION                              0x5
#define _IOCGP_IOCGP5_SIZE                                  0x1
#define _IOCGP_IOCGP5_LENGTH                                0x1
#define _IOCGP_IOCGP5_MASK                                  0x20

// Register: IOCGN
#define IOCGN IOCGN
extern volatile unsigned char           IOCGN               __at(0x1E61);
#ifndef _LIB_BUILD
asm("IOCGN equ 01E61h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned IOCGN5                 :1;
    };
} IOCGNbits_t;
extern volatile IOCGNbits_t IOCGNbits __at(0x1E61);
// bitfield macros
#define _IOCGN_IOCGN5_POSN                                  0x5
#define _IOCGN_IOCGN5_POSITION                              0x5
#define _IOCGN_IOCGN5_SIZE                                  0x1
#define _IOCGN_IOCGN5_LENGTH                                0x1
#define _IOCGN_IOCGN5_MASK                                  0x20

// Register: IOCGF
#define IOCGF IOCGF
extern volatile unsigned char           IOCGF               __at(0x1E62);
#ifndef _LIB_BUILD
asm("IOCGF equ 01E62h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned IOCGF5                 :1;
    };
} IOCGFbits_t;
extern volatile IOCGFbits_t IOCGFbits __at(0x1E62);
// bitfield macros
#define _IOCGF_IOCGF5_POSN                                  0x5
#define _IOCGF_IOCGF5_POSITION                              0x5
#define _IOCGF_IOCGF5_SIZE                                  0x1
#define _IOCGF_IOCGF5_LENGTH                                0x1
#define _IOCGF_IOCGF5_MASK                                  0x20

// Register: WPUH
#define WPUH WPUH
extern volatile unsigned char           WPUH                __at(0x1E67);
#ifndef _LIB_BUILD
asm("WPUH equ 01E67h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUH0                  :1;
        unsigned WPUH1                  :1;
        unsigned WPUH2                  :1;
        unsigned WPUH3                  :1;
    };
} WPUHbits_t;
extern volatile WPUHbits_t WPUHbits __at(0x1E67);
// bitfield macros
#define _WPUH_WPUH0_POSN                                    0x0
#define _WPUH_WPUH0_POSITION                                0x0
#define _WPUH_WPUH0_SIZE                                    0x1
#define _WPUH_WPUH0_LENGTH                                  0x1
#define _WPUH_WPUH0_MASK                                    0x1
#define _WPUH_WPUH1_POSN                                    0x1
#define _WPUH_WPUH1_POSITION                                0x1
#define _WPUH_WPUH1_SIZE                                    0x1
#define _WPUH_WPUH1_LENGTH                                  0x1
#define _WPUH_WPUH1_MASK                                    0x2
#define _WPUH_WPUH2_POSN                                    0x2
#define _WPUH_WPUH2_POSITION                                0x2
#define _WPUH_WPUH2_SIZE                                    0x1
#define _WPUH_WPUH2_LENGTH                                  0x1
#define _WPUH_WPUH2_MASK                                    0x4
#define _WPUH_WPUH3_POSN                                    0x3
#define _WPUH_WPUH3_POSITION                                0x3
#define _WPUH_WPUH3_SIZE                                    0x1
#define _WPUH_WPUH3_LENGTH                                  0x1
#define _WPUH_WPUH3_MASK                                    0x8

// Register: ODCONH
#define ODCONH ODCONH
extern volatile unsigned char           ODCONH              __at(0x1E68);
#ifndef _LIB_BUILD
asm("ODCONH equ 01E68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCH0                  :1;
        unsigned ODCH1                  :1;
        unsigned ODCH2                  :1;
        unsigned ODCH3                  :1;
    };
} ODCONHbits_t;
extern volatile ODCONHbits_t ODCONHbits __at(0x1E68);
// bitfield macros
#define _ODCONH_ODCH0_POSN                                  0x0
#define _ODCONH_ODCH0_POSITION                              0x0
#define _ODCONH_ODCH0_SIZE                                  0x1
#define _ODCONH_ODCH0_LENGTH                                0x1
#define _ODCONH_ODCH0_MASK                                  0x1
#define _ODCONH_ODCH1_POSN                                  0x1
#define _ODCONH_ODCH1_POSITION                              0x1
#define _ODCONH_ODCH1_SIZE                                  0x1
#define _ODCONH_ODCH1_LENGTH                                0x1
#define _ODCONH_ODCH1_MASK                                  0x2
#define _ODCONH_ODCH2_POSN                                  0x2
#define _ODCONH_ODCH2_POSITION                              0x2
#define _ODCONH_ODCH2_SIZE                                  0x1
#define _ODCONH_ODCH2_LENGTH                                0x1
#define _ODCONH_ODCH2_MASK                                  0x4
#define _ODCONH_ODCH3_POSN                                  0x3
#define _ODCONH_ODCH3_POSITION                              0x3
#define _ODCONH_ODCH3_SIZE                                  0x1
#define _ODCONH_ODCH3_LENGTH                                0x1
#define _ODCONH_ODCH3_MASK                                  0x8

// Register: SLRCONH
#define SLRCONH SLRCONH
extern volatile unsigned char           SLRCONH             __at(0x1E69);
#ifndef _LIB_BUILD
asm("SLRCONH equ 01E69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRH0                  :1;
        unsigned SLRH1                  :1;
        unsigned SLRH2                  :1;
        unsigned SLRH3                  :1;
    };
} SLRCONHbits_t;
extern volatile SLRCONHbits_t SLRCONHbits __at(0x1E69);
// bitfield macros
#define _SLRCONH_SLRH0_POSN                                 0x0
#define _SLRCONH_SLRH0_POSITION                             0x0
#define _SLRCONH_SLRH0_SIZE                                 0x1
#define _SLRCONH_SLRH0_LENGTH                               0x1
#define _SLRCONH_SLRH0_MASK                                 0x1
#define _SLRCONH_SLRH1_POSN                                 0x1
#define _SLRCONH_SLRH1_POSITION                             0x1
#define _SLRCONH_SLRH1_SIZE                                 0x1
#define _SLRCONH_SLRH1_LENGTH                               0x1
#define _SLRCONH_SLRH1_MASK                                 0x2
#define _SLRCONH_SLRH2_POSN                                 0x2
#define _SLRCONH_SLRH2_POSITION                             0x2
#define _SLRCONH_SLRH2_SIZE                                 0x1
#define _SLRCONH_SLRH2_LENGTH                               0x1
#define _SLRCONH_SLRH2_MASK                                 0x4
#define _SLRCONH_SLRH3_POSN                                 0x3
#define _SLRCONH_SLRH3_POSITION                             0x3
#define _SLRCONH_SLRH3_SIZE                                 0x1
#define _SLRCONH_SLRH3_LENGTH                               0x1
#define _SLRCONH_SLRH3_MASK                                 0x8

