GopalSaraf/Practicals/PSDL/include/proc/pic16f19196.h
#define                                 S29C6_bit           _BIT_ACCESS(LCDDATA39,5)
// LCDDATA45<S29C7>
extern volatile __bit                   S29C7               __at(0xEA2D);	// @ (0x1D45 * 8 + 5)
#define                                 S29C7_bit           _BIT_ACCESS(LCDDATA45,5)
// LCDDATA3<S30C0>
extern volatile __bit                   S30C0               __at(0xE8DE);	// @ (0x1D1B * 8 + 6)
#define                                 S30C0_bit           _BIT_ACCESS(LCDDATA3,6)
// LCDDATA9<S30C1>
extern volatile __bit                   S30C1               __at(0xE90E);	// @ (0x1D21 * 8 + 6)
#define                                 S30C1_bit           _BIT_ACCESS(LCDDATA9,6)
// LCDDATA15<S30C2>
extern volatile __bit                   S30C2               __at(0xE93E);	// @ (0x1D27 * 8 + 6)
#define                                 S30C2_bit           _BIT_ACCESS(LCDDATA15,6)
// LCDDATA21<S30C3>
extern volatile __bit                   S30C3               __at(0xE96E);	// @ (0x1D2D * 8 + 6)
#define                                 S30C3_bit           _BIT_ACCESS(LCDDATA21,6)
// LCDDATA27<S30C4>
extern volatile __bit                   S30C4               __at(0xE99E);	// @ (0x1D33 * 8 + 6)
#define                                 S30C4_bit           _BIT_ACCESS(LCDDATA27,6)
// LCDDATA33<S30C5>
extern volatile __bit                   S30C5               __at(0xE9CE);	// @ (0x1D39 * 8 + 6)
#define                                 S30C5_bit           _BIT_ACCESS(LCDDATA33,6)
// LCDDATA39<S30C6>
extern volatile __bit                   S30C6               __at(0xE9FE);	// @ (0x1D3F * 8 + 6)
#define                                 S30C6_bit           _BIT_ACCESS(LCDDATA39,6)
// LCDDATA45<S30C7>
extern volatile __bit                   S30C7               __at(0xEA2E);	// @ (0x1D45 * 8 + 6)
#define                                 S30C7_bit           _BIT_ACCESS(LCDDATA45,6)
// LCDDATA3<S31C0>
extern volatile __bit                   S31C0               __at(0xE8DF);	// @ (0x1D1B * 8 + 7)
#define                                 S31C0_bit           _BIT_ACCESS(LCDDATA3,7)
// LCDDATA9<S31C1>
extern volatile __bit                   S31C1               __at(0xE90F);	// @ (0x1D21 * 8 + 7)
#define                                 S31C1_bit           _BIT_ACCESS(LCDDATA9,7)
// LCDDATA15<S31C2>
extern volatile __bit                   S31C2               __at(0xE93F);	// @ (0x1D27 * 8 + 7)
#define                                 S31C2_bit           _BIT_ACCESS(LCDDATA15,7)
// LCDDATA21<S31C3>
extern volatile __bit                   S31C3               __at(0xE96F);	// @ (0x1D2D * 8 + 7)
#define                                 S31C3_bit           _BIT_ACCESS(LCDDATA21,7)
// LCDDATA27<S31C4>
extern volatile __bit                   S31C4               __at(0xE99F);	// @ (0x1D33 * 8 + 7)
#define                                 S31C4_bit           _BIT_ACCESS(LCDDATA27,7)
// LCDDATA33<S31C5>
extern volatile __bit                   S31C5               __at(0xE9CF);	// @ (0x1D39 * 8 + 7)
#define                                 S31C5_bit           _BIT_ACCESS(LCDDATA33,7)
// LCDDATA39<S31C6>
extern volatile __bit                   S31C6               __at(0xE9FF);	// @ (0x1D3F * 8 + 7)
#define                                 S31C6_bit           _BIT_ACCESS(LCDDATA39,7)
// LCDDATA45<S31C7>
extern volatile __bit                   S31C7               __at(0xEA2F);	// @ (0x1D45 * 8 + 7)
#define                                 S31C7_bit           _BIT_ACCESS(LCDDATA45,7)
// LCDDATA4<S32C0>
extern volatile __bit                   S32C0               __at(0xE8E0);	// @ (0x1D1C * 8 + 0)
#define                                 S32C0_bit           _BIT_ACCESS(LCDDATA4,0)
// LCDDATA10<S32C1>
extern volatile __bit                   S32C1               __at(0xE910);	// @ (0x1D22 * 8 + 0)
#define                                 S32C1_bit           _BIT_ACCESS(LCDDATA10,0)
// LCDDATA16<S32C2>
extern volatile __bit                   S32C2               __at(0xE940);	// @ (0x1D28 * 8 + 0)
#define                                 S32C2_bit           _BIT_ACCESS(LCDDATA16,0)
// LCDDATA22<S32C3>
extern volatile __bit                   S32C3               __at(0xE970);	// @ (0x1D2E * 8 + 0)
#define                                 S32C3_bit           _BIT_ACCESS(LCDDATA22,0)
// LCDDATA28<S32C4>
extern volatile __bit                   S32C4               __at(0xE9A0);	// @ (0x1D34 * 8 + 0)
#define                                 S32C4_bit           _BIT_ACCESS(LCDDATA28,0)
// LCDDATA34<S32C5>
extern volatile __bit                   S32C5               __at(0xE9D0);	// @ (0x1D3A * 8 + 0)
#define                                 S32C5_bit           _BIT_ACCESS(LCDDATA34,0)
// LCDDATA40<S32C6>
extern volatile __bit                   S32C6               __at(0xEA00);	// @ (0x1D40 * 8 + 0)
#define                                 S32C6_bit           _BIT_ACCESS(LCDDATA40,0)
// LCDDATA46<S32C7>
extern volatile __bit                   S32C7               __at(0xEA30);	// @ (0x1D46 * 8 + 0)
#define                                 S32C7_bit           _BIT_ACCESS(LCDDATA46,0)
// LCDDATA4<S33C0>
extern volatile __bit                   S33C0               __at(0xE8E1);	// @ (0x1D1C * 8 + 1)
#define                                 S33C0_bit           _BIT_ACCESS(LCDDATA4,1)
// LCDDATA10<S33C1>
extern volatile __bit                   S33C1               __at(0xE911);	// @ (0x1D22 * 8 + 1)
#define                                 S33C1_bit           _BIT_ACCESS(LCDDATA10,1)
// LCDDATA16<S33C2>
extern volatile __bit                   S33C2               __at(0xE941);	// @ (0x1D28 * 8 + 1)
#define                                 S33C2_bit           _BIT_ACCESS(LCDDATA16,1)
// LCDDATA22<S33C3>
extern volatile __bit                   S33C3               __at(0xE971);	// @ (0x1D2E * 8 + 1)
#define                                 S33C3_bit           _BIT_ACCESS(LCDDATA22,1)
// LCDDATA28<S33C4>
extern volatile __bit                   S33C4               __at(0xE9A1);	// @ (0x1D34 * 8 + 1)
#define                                 S33C4_bit           _BIT_ACCESS(LCDDATA28,1)
// LCDDATA34<S33C5>
extern volatile __bit                   S33C5               __at(0xE9D1);	// @ (0x1D3A * 8 + 1)
#define                                 S33C5_bit           _BIT_ACCESS(LCDDATA34,1)
// LCDDATA40<S33C6>
extern volatile __bit                   S33C6               __at(0xEA01);	// @ (0x1D40 * 8 + 1)
#define                                 S33C6_bit           _BIT_ACCESS(LCDDATA40,1)
// LCDDATA46<S33C7>
extern volatile __bit                   S33C7               __at(0xEA31);	// @ (0x1D46 * 8 + 1)
#define                                 S33C7_bit           _BIT_ACCESS(LCDDATA46,1)
// LCDDATA4<S34C0>
extern volatile __bit                   S34C0               __at(0xE8E2);	// @ (0x1D1C * 8 + 2)
#define                                 S34C0_bit           _BIT_ACCESS(LCDDATA4,2)
// LCDDATA10<S34C1>
extern volatile __bit                   S34C1               __at(0xE912);	// @ (0x1D22 * 8 + 2)
#define                                 S34C1_bit           _BIT_ACCESS(LCDDATA10,2)
// LCDDATA16<S34C2>
extern volatile __bit                   S34C2               __at(0xE942);	// @ (0x1D28 * 8 + 2)
#define                                 S34C2_bit           _BIT_ACCESS(LCDDATA16,2)
// LCDDATA22<S34C3>
extern volatile __bit                   S34C3               __at(0xE972);	// @ (0x1D2E * 8 + 2)
#define                                 S34C3_bit           _BIT_ACCESS(LCDDATA22,2)
// LCDDATA28<S34C4>
extern volatile __bit                   S34C4               __at(0xE9A2);	// @ (0x1D34 * 8 + 2)
#define                                 S34C4_bit           _BIT_ACCESS(LCDDATA28,2)
// LCDDATA34<S34C5>
extern volatile __bit                   S34C5               __at(0xE9D2);	// @ (0x1D3A * 8 + 2)
#define                                 S34C5_bit           _BIT_ACCESS(LCDDATA34,2)
// LCDDATA40<S34C6>
extern volatile __bit                   S34C6               __at(0xEA02);	// @ (0x1D40 * 8 + 2)
#define                                 S34C6_bit           _BIT_ACCESS(LCDDATA40,2)
// LCDDATA46<S34C7>
extern volatile __bit                   S34C7               __at(0xEA32);	// @ (0x1D46 * 8 + 2)
#define                                 S34C7_bit           _BIT_ACCESS(LCDDATA46,2)
// LCDDATA4<S35C0>
extern volatile __bit                   S35C0               __at(0xE8E3);	// @ (0x1D1C * 8 + 3)
#define                                 S35C0_bit           _BIT_ACCESS(LCDDATA4,3)
// LCDDATA10<S35C1>
extern volatile __bit                   S35C1               __at(0xE913);	// @ (0x1D22 * 8 + 3)
#define                                 S35C1_bit           _BIT_ACCESS(LCDDATA10,3)
// LCDDATA16<S35C2>
extern volatile __bit                   S35C2               __at(0xE943);	// @ (0x1D28 * 8 + 3)
#define                                 S35C2_bit           _BIT_ACCESS(LCDDATA16,3)
// LCDDATA22<S35C3>
extern volatile __bit                   S35C3               __at(0xE973);	// @ (0x1D2E * 8 + 3)
#define                                 S35C3_bit           _BIT_ACCESS(LCDDATA22,3)
// LCDDATA28<S35C4>
extern volatile __bit                   S35C4               __at(0xE9A3);	// @ (0x1D34 * 8 + 3)
#define                                 S35C4_bit           _BIT_ACCESS(LCDDATA28,3)
// LCDDATA34<S35C5>
extern volatile __bit                   S35C5               __at(0xE9D3);	// @ (0x1D3A * 8 + 3)
#define                                 S35C5_bit           _BIT_ACCESS(LCDDATA34,3)
// LCDDATA40<S35C6>
extern volatile __bit                   S35C6               __at(0xEA03);	// @ (0x1D40 * 8 + 3)
#define                                 S35C6_bit           _BIT_ACCESS(LCDDATA40,3)
// LCDDATA46<S35C7>
extern volatile __bit                   S35C7               __at(0xEA33);	// @ (0x1D46 * 8 + 3)
#define                                 S35C7_bit           _BIT_ACCESS(LCDDATA46,3)
// LCDDATA4<S36C0>
extern volatile __bit                   S36C0               __at(0xE8E4);	// @ (0x1D1C * 8 + 4)
#define                                 S36C0_bit           _BIT_ACCESS(LCDDATA4,4)
// LCDDATA10<S36C1>
extern volatile __bit                   S36C1               __at(0xE914);	// @ (0x1D22 * 8 + 4)
#define                                 S36C1_bit           _BIT_ACCESS(LCDDATA10,4)
// LCDDATA16<S36C2>
extern volatile __bit                   S36C2               __at(0xE944);	// @ (0x1D28 * 8 + 4)
#define                                 S36C2_bit           _BIT_ACCESS(LCDDATA16,4)
// LCDDATA22<S36C3>
extern volatile __bit                   S36C3               __at(0xE974);	// @ (0x1D2E * 8 + 4)
#define                                 S36C3_bit           _BIT_ACCESS(LCDDATA22,4)
// LCDDATA28<S36C4>
extern volatile __bit                   S36C4               __at(0xE9A4);	// @ (0x1D34 * 8 + 4)
#define                                 S36C4_bit           _BIT_ACCESS(LCDDATA28,4)
// LCDDATA34<S36C5>
extern volatile __bit                   S36C5               __at(0xE9D4);	// @ (0x1D3A * 8 + 4)
#define                                 S36C5_bit           _BIT_ACCESS(LCDDATA34,4)
// LCDDATA40<S36C6>
extern volatile __bit                   S36C6               __at(0xEA04);	// @ (0x1D40 * 8 + 4)
#define                                 S36C6_bit           _BIT_ACCESS(LCDDATA40,4)
// LCDDATA46<S36C7>
extern volatile __bit                   S36C7               __at(0xEA34);	// @ (0x1D46 * 8 + 4)
#define                                 S36C7_bit           _BIT_ACCESS(LCDDATA46,4)
// LCDDATA4<S37C0>
extern volatile __bit                   S37C0               __at(0xE8E5);	// @ (0x1D1C * 8 + 5)
#define                                 S37C0_bit           _BIT_ACCESS(LCDDATA4,5)
// LCDDATA10<S37C1>
extern volatile __bit                   S37C1               __at(0xE915);	// @ (0x1D22 * 8 + 5)
#define                                 S37C1_bit           _BIT_ACCESS(LCDDATA10,5)
// LCDDATA16<S37C2>
extern volatile __bit                   S37C2               __at(0xE945);	// @ (0x1D28 * 8 + 5)
#define                                 S37C2_bit           _BIT_ACCESS(LCDDATA16,5)
// LCDDATA22<S37C3>
extern volatile __bit                   S37C3               __at(0xE975);	// @ (0x1D2E * 8 + 5)
#define                                 S37C3_bit           _BIT_ACCESS(LCDDATA22,5)
// LCDDATA28<S37C4>
extern volatile __bit                   S37C4               __at(0xE9A5);	// @ (0x1D34 * 8 + 5)
#define                                 S37C4_bit           _BIT_ACCESS(LCDDATA28,5)
// LCDDATA34<S37C5>
extern volatile __bit                   S37C5               __at(0xE9D5);	// @ (0x1D3A * 8 + 5)
#define                                 S37C5_bit           _BIT_ACCESS(LCDDATA34,5)
// LCDDATA40<S37C6>
extern volatile __bit                   S37C6               __at(0xEA05);	// @ (0x1D40 * 8 + 5)
#define                                 S37C6_bit           _BIT_ACCESS(LCDDATA40,5)
// LCDDATA46<S37C7>
extern volatile __bit                   S37C7               __at(0xEA35);	// @ (0x1D46 * 8 + 5)
#define                                 S37C7_bit           _BIT_ACCESS(LCDDATA46,5)
// LCDDATA4<S38C0>
extern volatile __bit                   S38C0               __at(0xE8E6);	// @ (0x1D1C * 8 + 6)
#define                                 S38C0_bit           _BIT_ACCESS(LCDDATA4,6)
// LCDDATA10<S38C1>
extern volatile __bit                   S38C1               __at(0xE916);	// @ (0x1D22 * 8 + 6)
#define                                 S38C1_bit           _BIT_ACCESS(LCDDATA10,6)
// LCDDATA16<S38C2>
extern volatile __bit                   S38C2               __at(0xE946);	// @ (0x1D28 * 8 + 6)
#define                                 S38C2_bit           _BIT_ACCESS(LCDDATA16,6)
// LCDDATA22<S38C3>
extern volatile __bit                   S38C3               __at(0xE976);	// @ (0x1D2E * 8 + 6)
#define                                 S38C3_bit           _BIT_ACCESS(LCDDATA22,6)
// LCDDATA28<S38C4>
extern volatile __bit                   S38C4               __at(0xE9A6);	// @ (0x1D34 * 8 + 6)
#define                                 S38C4_bit           _BIT_ACCESS(LCDDATA28,6)
// LCDDATA34<S38C5>
extern volatile __bit                   S38C5               __at(0xE9D6);	// @ (0x1D3A * 8 + 6)
#define                                 S38C5_bit           _BIT_ACCESS(LCDDATA34,6)
// LCDDATA40<S38C6>
extern volatile __bit                   S38C6               __at(0xEA06);	// @ (0x1D40 * 8 + 6)
#define                                 S38C6_bit           _BIT_ACCESS(LCDDATA40,6)
// LCDDATA46<S38C7>
extern volatile __bit                   S38C7               __at(0xEA36);	// @ (0x1D46 * 8 + 6)
#define                                 S38C7_bit           _BIT_ACCESS(LCDDATA46,6)
// LCDDATA4<S39C0>
extern volatile __bit                   S39C0               __at(0xE8E7);	// @ (0x1D1C * 8 + 7)
#define                                 S39C0_bit           _BIT_ACCESS(LCDDATA4,7)
// LCDDATA10<S39C1>
extern volatile __bit                   S39C1               __at(0xE917);	// @ (0x1D22 * 8 + 7)
#define                                 S39C1_bit           _BIT_ACCESS(LCDDATA10,7)
// LCDDATA16<S39C2>
extern volatile __bit                   S39C2               __at(0xE947);	// @ (0x1D28 * 8 + 7)
#define                                 S39C2_bit           _BIT_ACCESS(LCDDATA16,7)
// LCDDATA22<S39C3>
extern volatile __bit                   S39C3               __at(0xE977);	// @ (0x1D2E * 8 + 7)
#define                                 S39C3_bit           _BIT_ACCESS(LCDDATA22,7)
// LCDDATA28<S39C4>
extern volatile __bit                   S39C4               __at(0xE9A7);	// @ (0x1D34 * 8 + 7)
#define                                 S39C4_bit           _BIT_ACCESS(LCDDATA28,7)
// LCDDATA34<S39C5>
extern volatile __bit                   S39C5               __at(0xE9D7);	// @ (0x1D3A * 8 + 7)
#define                                 S39C5_bit           _BIT_ACCESS(LCDDATA34,7)
// LCDDATA40<S39C6>
extern volatile __bit                   S39C6               __at(0xEA07);	// @ (0x1D40 * 8 + 7)
#define                                 S39C6_bit           _BIT_ACCESS(LCDDATA40,7)
// LCDDATA46<S39C7>
extern volatile __bit                   S39C7               __at(0xEA37);	// @ (0x1D46 * 8 + 7)
#define                                 S39C7_bit           _BIT_ACCESS(LCDDATA46,7)
// LCDDATA5<S40C0>
extern volatile __bit                   S40C0               __at(0xE8E8);	// @ (0x1D1D * 8 + 0)
#define                                 S40C0_bit           _BIT_ACCESS(LCDDATA5,0)
// LCDDATA11<S40C1>
extern volatile __bit                   S40C1               __at(0xE918);	// @ (0x1D23 * 8 + 0)
#define                                 S40C1_bit           _BIT_ACCESS(LCDDATA11,0)
// LCDDATA17<S40C2>
extern volatile __bit                   S40C2               __at(0xE948);	// @ (0x1D29 * 8 + 0)
#define                                 S40C2_bit           _BIT_ACCESS(LCDDATA17,0)
// LCDDATA23<S40C3>
extern volatile __bit                   S40C3               __at(0xE978);	// @ (0x1D2F * 8 + 0)
#define                                 S40C3_bit           _BIT_ACCESS(LCDDATA23,0)
// LCDDATA29<S40C4>
extern volatile __bit                   S40C4               __at(0xE9A8);	// @ (0x1D35 * 8 + 0)
#define                                 S40C4_bit           _BIT_ACCESS(LCDDATA29,0)
// LCDDATA35<S40C5>
extern volatile __bit                   S40C5               __at(0xE9D8);	// @ (0x1D3B * 8 + 0)
#define                                 S40C5_bit           _BIT_ACCESS(LCDDATA35,0)
// LCDDATA41<S40C6>
extern volatile __bit                   S40C6               __at(0xEA08);	// @ (0x1D41 * 8 + 0)
#define                                 S40C6_bit           _BIT_ACCESS(LCDDATA41,0)
// LCDDATA47<S40C7>
extern volatile __bit                   S40C7               __at(0xEA38);	// @ (0x1D47 * 8 + 0)
#define                                 S40C7_bit           _BIT_ACCESS(LCDDATA47,0)
// LCDDATA5<S41C0>
extern volatile __bit                   S41C0               __at(0xE8E9);	// @ (0x1D1D * 8 + 1)
#define                                 S41C0_bit           _BIT_ACCESS(LCDDATA5,1)
// LCDDATA11<S41C1>
extern volatile __bit                   S41C1               __at(0xE919);	// @ (0x1D23 * 8 + 1)
#define                                 S41C1_bit           _BIT_ACCESS(LCDDATA11,1)
// LCDDATA17<S41C2>
extern volatile __bit                   S41C2               __at(0xE949);	// @ (0x1D29 * 8 + 1)
#define                                 S41C2_bit           _BIT_ACCESS(LCDDATA17,1)
// LCDDATA23<S41C3>
extern volatile __bit                   S41C3               __at(0xE979);	// @ (0x1D2F * 8 + 1)
#define                                 S41C3_bit           _BIT_ACCESS(LCDDATA23,1)
// LCDDATA29<S41C4>
extern volatile __bit                   S41C4               __at(0xE9A9);	// @ (0x1D35 * 8 + 1)
#define                                 S41C4_bit           _BIT_ACCESS(LCDDATA29,1)
// LCDDATA35<S41C5>
extern volatile __bit                   S41C5               __at(0xE9D9);	// @ (0x1D3B * 8 + 1)
#define                                 S41C5_bit           _BIT_ACCESS(LCDDATA35,1)
// LCDDATA41<S41C6>
extern volatile __bit                   S41C6               __at(0xEA09);	// @ (0x1D41 * 8 + 1)
#define                                 S41C6_bit           _BIT_ACCESS(LCDDATA41,1)
// LCDDATA47<S41C7>
extern volatile __bit                   S41C7               __at(0xEA39);	// @ (0x1D47 * 8 + 1)
#define                                 S41C7_bit           _BIT_ACCESS(LCDDATA47,1)
// LCDDATA5<S42C0>
extern volatile __bit                   S42C0               __at(0xE8EA);	// @ (0x1D1D * 8 + 2)
#define                                 S42C0_bit           _BIT_ACCESS(LCDDATA5,2)
// LCDDATA11<S42C1>
extern volatile __bit                   S42C1               __at(0xE91A);	// @ (0x1D23 * 8 + 2)
#define                                 S42C1_bit           _BIT_ACCESS(LCDDATA11,2)
// LCDDATA17<S42C2>
extern volatile __bit                   S42C2               __at(0xE94A);	// @ (0x1D29 * 8 + 2)
#define                                 S42C2_bit           _BIT_ACCESS(LCDDATA17,2)
// LCDDATA23<S42C3>
extern volatile __bit                   S42C3               __at(0xE97A);	// @ (0x1D2F * 8 + 2)
#define                                 S42C3_bit           _BIT_ACCESS(LCDDATA23,2)
// LCDDATA29<S42C4>
extern volatile __bit                   S42C4               __at(0xE9AA);	// @ (0x1D35 * 8 + 2)
#define                                 S42C4_bit           _BIT_ACCESS(LCDDATA29,2)
// LCDDATA35<S42C5>
extern volatile __bit                   S42C5               __at(0xE9DA);	// @ (0x1D3B * 8 + 2)
#define                                 S42C5_bit           _BIT_ACCESS(LCDDATA35,2)
// LCDDATA41<S42C6>
extern volatile __bit                   S42C6               __at(0xEA0A);	// @ (0x1D41 * 8 + 2)
#define                                 S42C6_bit           _BIT_ACCESS(LCDDATA41,2)
// LCDDATA47<S42C7>
extern volatile __bit                   S42C7               __at(0xEA3A);	// @ (0x1D47 * 8 + 2)
#define                                 S42C7_bit           _BIT_ACCESS(LCDDATA47,2)
// LCDDATA5<S43C0>
extern volatile __bit                   S43C0               __at(0xE8EB);	// @ (0x1D1D * 8 + 3)
#define                                 S43C0_bit           _BIT_ACCESS(LCDDATA5,3)
// LCDDATA11<S43C1>
extern volatile __bit                   S43C1               __at(0xE91B);	// @ (0x1D23 * 8 + 3)
#define                                 S43C1_bit           _BIT_ACCESS(LCDDATA11,3)
// LCDDATA17<S43C2>
extern volatile __bit                   S43C2               __at(0xE94B);	// @ (0x1D29 * 8 + 3)
#define                                 S43C2_bit           _BIT_ACCESS(LCDDATA17,3)
// LCDDATA23<S43C3>
extern volatile __bit                   S43C3               __at(0xE97B);	// @ (0x1D2F * 8 + 3)
#define                                 S43C3_bit           _BIT_ACCESS(LCDDATA23,3)
// LCDDATA29<S43C4>
extern volatile __bit                   S43C4               __at(0xE9AB);	// @ (0x1D35 * 8 + 3)
#define                                 S43C4_bit           _BIT_ACCESS(LCDDATA29,3)
// LCDDATA35<S43C5>
extern volatile __bit                   S43C5               __at(0xE9DB);	// @ (0x1D3B * 8 + 3)
#define                                 S43C5_bit           _BIT_ACCESS(LCDDATA35,3)
// LCDDATA41<S43C6>
extern volatile __bit                   S43C6               __at(0xEA0B);	// @ (0x1D41 * 8 + 3)
#define                                 S43C6_bit           _BIT_ACCESS(LCDDATA41,3)
// LCDDATA47<S43C7>
extern volatile __bit                   S43C7               __at(0xEA3B);	// @ (0x1D47 * 8 + 3)
#define                                 S43C7_bit           _BIT_ACCESS(LCDDATA47,3)
// LCDDATA5<S44C0>
extern volatile __bit                   S44C0               __at(0xE8EC);	// @ (0x1D1D * 8 + 4)
#define                                 S44C0_bit           _BIT_ACCESS(LCDDATA5,4)
// LCDDATA11<S44C1>
extern volatile __bit                   S44C1               __at(0xE91C);	// @ (0x1D23 * 8 + 4)
#define                                 S44C1_bit           _BIT_ACCESS(LCDDATA11,4)
// LCDDATA17<S44C2>
extern volatile __bit                   S44C2               __at(0xE94C);	// @ (0x1D29 * 8 + 4)
#define                                 S44C2_bit           _BIT_ACCESS(LCDDATA17,4)
// LCDDATA23<S44C3>
extern volatile __bit                   S44C3               __at(0xE97C);	// @ (0x1D2F * 8 + 4)
#define                                 S44C3_bit           _BIT_ACCESS(LCDDATA23,4)
// LCDDATA29<S44C4>
extern volatile __bit                   S44C4               __at(0xE9AC);	// @ (0x1D35 * 8 + 4)
#define                                 S44C4_bit           _BIT_ACCESS(LCDDATA29,4)
// LCDDATA35<S44C5>
extern volatile __bit                   S44C5               __at(0xE9DC);	// @ (0x1D3B * 8 + 4)
#define                                 S44C5_bit           _BIT_ACCESS(LCDDATA35,4)
// LCDDATA41<S44C6>
